; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj4 obj8 - airport
	obj1 obj5 - city
	obj2 obj7 obj9 obj13 obj15 - location
	obj3 obj6 obj10 - truck
	obj11 - airplane
	obj12 obj14 obj16 - package
)

(:init
	(in-city obj9 obj5)
	(in-city obj2 obj1)
	(at obj3 obj0)
	(at obj11 obj0)
	(in-city obj13 obj1)
	(at obj14 obj9)
	(in-city obj4 obj5)
	(in-city obj0 obj1)
	(in-city obj8 obj1)
	(at obj12 obj7)
	(at obj16 obj15)
	(at obj6 obj4)
	(in-city obj7 obj5)
	(at obj10 obj8)
	(in-city obj15 obj1)
)

(:goal (and
	(at obj16 obj7)
	(at obj14 obj13)
	(at obj12 obj15)
))
)

; plan
1. (drive obj6 obj4 obj7)
   deleted: (at obj6 obj4)
   added: (at obj6 obj7)
   goals met: 0 of 3
2. (load obj6 obj12 obj7)
   deleted: (at obj12 obj7)
   added: (in obj12 obj6)
   goals met: 0 of 3
3. (drive obj6 obj7 obj4)
   deleted: (at obj6 obj7)
   added: (at obj6 obj4)
   goals met: 0 of 3
4. (unload obj6 obj12 obj4)
   deleted: (in obj12 obj6)
   added: (at obj12 obj4)
   goals met: 0 of 3
5. (drive obj6 obj4 obj9)
   deleted: (at obj6 obj4)
   added: (at obj6 obj9)
   goals met: 0 of 3
6. (load obj6 obj14 obj9)
   deleted: (at obj14 obj9)
   added: (in obj14 obj6)
   goals met: 0 of 3
7. (drive obj6 obj9 obj4)
   deleted: (at obj6 obj9)
   added: (at obj6 obj4)
   goals met: 0 of 3
8. (unload obj6 obj14 obj4)
   deleted: (in obj14 obj6)
   added: (at obj14 obj4)
   goals met: 0 of 3
9. (drive obj3 obj0 obj13)
   deleted: (at obj3 obj0)
   added: (at obj3 obj13)
   goals met: 0 of 3
10. (fly obj11 obj0 obj4)
   deleted: (at obj11 obj0)
   added: (at obj11 obj4)
   goals met: 0 of 3
11. (load obj11 obj14 obj4)
   deleted: (at obj14 obj4)
   added: (in obj14 obj11)
   goals met: 0 of 3
12. (load obj11 obj12 obj4)
   deleted: (at obj12 obj4)
   added: (in obj12 obj11)
   goals met: 0 of 3
13. (drive obj10 obj8 obj15)
   deleted: (at obj10 obj8)
   added: (at obj10 obj15)
   goals met: 0 of 3
14. (load obj10 obj16 obj15)
   deleted: (at obj16 obj15)
   added: (in obj16 obj10)
   goals met: 0 of 3
15. (fly obj11 obj4 obj0)
   deleted: (at obj11 obj4)
   added: (at obj11 obj0)
   goals met: 0 of 3
16. (unload obj11 obj14 obj0)
   deleted: (in obj14 obj11)
   added: (at obj14 obj0)
   goals met: 0 of 3
17. (unload obj11 obj12 obj0)
   deleted: (in obj12 obj11)
   added: (at obj12 obj0)
   goals met: 0 of 3
18. (drive obj10 obj15 obj0)
   deleted: (at obj10 obj15)
   added: (at obj10 obj0)
   goals met: 0 of 3
19. (unload obj10 obj16 obj0)
   deleted: (in obj16 obj10)
   added: (at obj16 obj0)
   goals met: 0 of 3
20. (load obj11 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj11)
   goals met: 0 of 3
21. (fly obj11 obj0 obj4)
   deleted: (at obj11 obj0)
   added: (at obj11 obj4)
   goals met: 0 of 3
22. (unload obj11 obj16 obj4)
   deleted: (in obj16 obj11)
   added: (at obj16 obj4)
   goals met: 0 of 3
23. (load obj6 obj16 obj4)
   deleted: (at obj16 obj4)
   added: (in obj16 obj6)
   goals met: 0 of 3
24. (drive obj6 obj4 obj7)
   deleted: (at obj6 obj4)
   added: (at obj6 obj7)
   goals met: 0 of 3
25. (unload obj6 obj16 obj7)
   deleted: (in obj16 obj6)
   added: (at obj16 obj7)
   goals met: 1 of 3
26. (load obj10 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj10)
   goals met: 1 of 3
27. (load obj10 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj10)
   goals met: 1 of 3
28. (drive obj10 obj0 obj13)
   deleted: (at obj10 obj0)
   added: (at obj10 obj13)
   goals met: 1 of 3
29. (unload obj10 obj14 obj13)
   deleted: (in obj14 obj10)
   added: (at obj14 obj13)
   goals met: 2 of 3
30. (drive obj10 obj13 obj15)
   deleted: (at obj10 obj13)
   added: (at obj10 obj15)
   goals met: 2 of 3
31. (unload obj10 obj12 obj15)
   deleted: (in obj12 obj10)
   added: (at obj12 obj15)
   goals met: 3 of 3
